package com.gamegenius.help;

public class Database {
    String[] math_semes = new String[]{
            "Чему равно произведение разности двух выражений и их суммы? Запишите ответ в виде формулы и докажите её. Чему равна разность квадратов двух выражений? Приведите примеры.",
            "Чему равен квадрат суммы двух выражений? Запишите ответ в виде формулы и докажите её.",
            "Чему равен квадрат разности двух выражений? Запишите ответ в виде формулы и докажите её.",
            "Сформулируйте определение квадратного трёхчлена и приведите примеры. Покажите на примере как разложить на множители квадратный трёхчлен x2 +4x +3",
            "Чему равен квадрат трёх слагаемых? Запишите ответ в виде формулы. Приведите примеры.\n" +
                    "Чему равен квадрат четырёх слагаемых? Запишите ответ в виде формулы. Приведите примеры.",
            "Чему равен куб суммы двух выражений? Запишите ответ в виде формулы и докажите её.\n" +
                    "Чему равен куб разности двух выражений? Запишите ответ в виде формулы и докажите её.",
            "Чему равна разность кубов двух выражений? Запишите ответ в виде формулы. Приведите примеры. Чему равно произведение разности двух выражений и неполного квадрата их суммы? Приведите примеры.",
            "Чему равна сумма кубов двух выражений? Запишите ответ в виде формулы. Приведите примеры. Чему равно произведение суммы двух выражений и неполного квадрата их разности? Приведите примеры.",
            "Разложение на множители разности n-ых степеней. Запишите ответ в виде формулы. Приведите примеры. Разложение на множители суммы n-ых степеней. Запишите ответ в виде формулы. Приведите примеры.",
            "Определение функции, О.О.Ф., О.З.Ф., график функции, нули функции, промежутки знакопостоянства.",
            "Функция прямой пропорциональности и ее свойства",
            "Линейная функция, её свойства",
            "Взаимное расположение графиков линейных функций (пересекаются, параллельны, перпендикулярны)",
            "Определение степенной функции. Функция \uD835\uDC66=\uD835\uDC652, её свойства. Функция \uD835\uDC66=\uD835\uDC653, её свойства",
            "Определение линейного уравнения с двумя переменными, график линейного уравнения с двумя переменными в зависимости от чисел а, b, c.",
            "Наличие решений системы двух линейных уравнений с двумя переменными \n{\uD835\uDC4E1\uD835\uDC65+\uD835\uDC4F1\n{\uD835\uDC66=\uD835\uDC501\uD835\uDC4E2\uD835\uDC65+\uD835\uDC4F2\uD835\uDC66=\uD835\uDC502"
    };
    String[] russian = new String[]{
            "Выбор буквы в безударном окончании причастия",
            "Разряды причастий по значению. Образование причастий.",
            "Выбор буквы в суффиксе причастия",
            "Причастный оборот. Обособление причастного оборота ",
            "Отглагольное прилагательное. Н и НН в суффиксах страдательных причастий прошедшего времени и отглагольных прилагательных",
            "Полная и краткая форма причастий и отглагольных прилагательных",
            "Правописание НЕ с причастиями",
            "Буквы о/ё после шипящих в суффиксах страдательных причастий прошедшего времени. Морфемный и морфологический разбор причастия",
            "Орфография (5 класс) "};
    String[] physis_semes = new String[]{
            "Давление",
            "Гидростатическое давление",
            "Работа упруго-деформированного тела",
            "Сила Архимеда",
            "Мощность",
            "Импульс тела",
            "Рычаги, блоки, золотое правило механики",
            "Энергия",
            "Работа, КПД"
    };
    String[] program_semes = new String[]{
            "Переменные",
            "Переменные в функциях",
            "Функции",
            "Формула Герона",
            "Плоскость"
    };
}
